app/views/posts/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?)  [["post_id", 2], ["post_id", 1]]
---
       <%= link_to(post_path(post)) do %>
        <%= image_tag post.photos.first.image.url(:medium), class: "card-img-top" %>