app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "っっっd"], ["post_id", 10], ["user_id", 4], ["created_at", "2020-07-15 03:47:19.325322"], ["updated_at", "2020-07-15 03:47:19.325322"]]
---
  def create
     @comment = Comment.new(comment_params)
     @post = @comment.post
     if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
   def destroy
     @comment = Comment.find_by(id: params[:id])
     @post = @comment.post
     if @comment.destroy