app/controllers/inquiries_controller.rb

  def confirm
    @inquiry = Inquiry.new(inquiry_params)
   if @inquiry.save
---
INSERT INTO "inquiries" ("name", "email", "relationship", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "高野純一"], ["email", "takanoj19920616@gmail.com"], ["relationship", "友人"], ["content", "kk"], ["created_at", "2020-07-16 04:00:23.454487"], ["updated_at", "2020-07-16 04:00:23.454487"]]