app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 5], ["user_id", 3], ["created_at", "2020-07-15 02:54:08.946394"], ["updated_at", "2020-07-15 02:54:08.946394"]]
---
  def create
    @like = current_user.likes.build(like_params)
    @post = @like.post
    if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find_by(id: params[:id])
    @post = @like.post
    if @like.destroy