app/controllers/posts_controller.rb

def create
  @post = Post.new(post_params)
  if @post.photos.present?
     @post.save
---
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "F0D43464-32C2-452D-BFD4-949257467372.jpeg"], ["post_id", 3], ["created_at", "2020-07-15 02:53:10.509937"], ["updated_at", "2020-07-15 02:53:10.509937"]]
INSERT INTO "posts" ("caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["caption", ""], ["user_id", 3], ["created_at", "2020-07-15 02:53:10.461182"], ["updated_at", "2020-07-15 02:53:10.461182"]]

def index
  @posts = Post.limit(10).includes(:photos, :user).order('created_at DESC')
---
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 10]]
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?)  [["post_id", 2], ["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 4], ["id", 3]]

def destroy
    if @post.user == current_user
      flash[:notice] = "投稿が削除されました" if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

   def set_post
     @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]