app/models/post.rb

  def liked_by(user)
   # user_idとpost_idが一致するlikeを検索する
   Like.find_by(user_id: user.id, post_id: id)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 3], ["post_id", 5], ["LIMIT", 1]]